Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: This is described in a dedicated guide: xref:kafka-schema-registry-avro.adoc[Using Apache Kafka with Schema Registry and Avro].
zh_cn: 这部分在一个专门的指南中有所描述。 link:kafka-schema-registry-avro.html[使用Apache Kafka与Schema Registry和Avro协同工作] 。

source: This is described in a dedicated guide: xref:kafka-streams.adoc[Using Apache Kafka Streams].
zh_cn: 这部分在专门的指南中有所描述：link:kafka-streams.html[使用Apache Kafka流] 。

source: This is helpful for both Java developers who are used to working with the imperative model and don’t want to switch things up, and those working with a cloud-native/reactive approach. The Quarkus development model can adapt itself to whatever app you’re developing.
zh_cn: 这对于那些习惯于使用指令式模型并且不想改变的Java开发人员，以及那些使用原生云/响应式方法的开发人员都是有帮助的。Quarkus开发模型可以适应您正在开发的任何应用程序。

source: This is needed if you are not using xref:redis-dev-services.adoc[Dev Services for Redis]
zh_cn: 在不使用 link:redis-dev-services.html[Dev Services for Redis] 的情况下需要配置

source: This is solved by using a `null` key (represented by `~`) for any YAML property which is a prefix of another one:
zh_cn: 这可以通过为任意YAML属性使用 `null` 键（以 `~` 为代表）来解决，该属性是另一个属性的前缀:

source: This is the default behavior of an application subscribing to a Kafka topic: Each Kafka connector will create a single consumer thread and place it inside a single consumer group. Consumer group id defaults to the application name as set by the `quarkus.application.name` configuration property. It can also be set using the `kafka.group.id` property.
zh_cn: 这是一个应用程序订阅Kafka topic的默认方式：每个Kafka Connector将创建一个独立的消费者线程，并将其置于一个单独的消费者组内。消费者组id默认为 `quarkus.application.name` 所设定的应用程序名称。它也可以使用 `kafka.group.id` 来设置。

source: This is the default semantic. If an existing transaction is already associated with the current thread then the transaction is suspended, and resumed once the current transaction is complete. A new transaction is started after the existing transaction is suspended, and follows all the normal lifecycle rules.
zh_cn: 这是默认的语义。如果一个现有的事务已经与当前线程相关联，那么该事务将被暂停，并在当前事务完成后恢复。一个新的事务在现有事务被暂停后开始，并遵循所有正常的生命周期规则。

source: This is useful as it removes the need to store sensitive data in application.properties.
zh_cn: 这样可以避免在application.properties中存储敏感数据，很实用。

source: This is useful to create a client dynamically in a non-CDI bean e.g a xref:hibernate-orm-panache.adoc[Panache entity]. Or to create a different client when running in pub/sub mode. This mode requires two different connections because once a connection invokes a subscriber mode then it cannot be used for running other commands than the command to leave that mode.
zh_cn: 这对于在非CDI bean中动态地创建客户端非常有用，例如在 link:hibernate-orm-panache.html[Panache 实体类] 中使用Redis客户端，或者在pub/sub模式下运行时创建一个不同的客户端。这种模式需要两个不同的客户端连接，因为如果某个连接使用了订阅者模式，那么它就不能用于运行其他命令，直到退出订阅者模式。

source: This leads us to our next section.
zh_cn: 这将我们引向下一节。

source: This method can be used for any normal scoped CDI bean (e.g. `@ApplicationScoped`, `@RequestScoped` etc, basically every scope except `@Singleton` and `@Dependent`).
zh_cn: 该方法可以用于任何正常scope的CDI Bean（例如： `@ApplicationScoped` , `@RequestScoped` 等，基本上是除了 `@Singleton` 和 `@Dependent` 以外的scope ）。

source: This method returns a `Response` and not a list of `Legume`.
zh_cn: 该方法返回一个 `Response` ，而不是一个 `Legume` 列表。

source: This multi-stage Docker build copies the Maven wrapper from the host machine. The Maven wrapper (or the Gradle wrapper) is a convenient way to provide a specific version of Maven/Gradle. It avoids having to create a base image with Maven and Gradle. To provision the Maven Wrapper in your project, use: `mvn -N org.apache.maven.plugins:maven-wrapper-plugin:3.1.0:wrapper`.
zh_cn: 这种多阶段Docker构建从主机上复制Maven包装器。Maven包装器（或Gradle包装器）是提供特定版本Maven/Gradle的一种便捷方式。它避免了用Maven和Gradle创建一个基础镜像。要在项目中配置Maven包装器，请使用： `mvn -N org.apache.maven.plugins:maven-wrapper-plugin:3.1.0:wrapper` 。

source: This new endpoint will be located at /secured/roles-allowed
zh_cn: 这个新的endpoint将位于/secured/roles-allowed

source: This permission references the built-in `deny` policy for `/forbidden`. This is an exact path match as it does not end with `*`.
zh_cn: 这个权限引用了内置的 `deny` 策略来作用于 `/forbidden` 。这是一个精确的路径匹配，因为它没有以 `*` 结尾。

source: This permission references the default `permit` built-in policy to allow `GET` methods to `/public`. This is actually a no-op in this example, as this request would have been allowed anyway.
zh_cn: 这个权限引用了默认的 `permit` 内置策略，允许 `GET` 方法访问 `/public` 。在这个例子中，这实际上是一个空操作，因为这个请求无论如何都会被允许。

source: This procedure was formerly accomplished using the `@NativeImageTest` annotation. `@NativeImageTest` is considered deprecated in favor of `@QuarkusIntegrationTest` which provides a superset of the testing capabilities of `@NativeImageTest`. More information about `@QuarkusIntegrationTest` can be found in the xref:getting-started-testing.adoc#quarkus-integration-test[Testing Guide].
zh_cn: 这个过程以前是用 `@NativeImageTest` 注释来完成的。 `@NativeImageTest` 正考虑被废弃掉，请采用 `@QuarkusIntegrationTest` ，它提供了 `@NativeImageTest` 的测试能力的超集。关于 `@QuarkusIntegrationTest` 的更多信息可以在 xref:getting-started-testing.adoc#quarkus-integration-test[测试指南] 中找到。

source: This project follows the <a href="#">all-contributors</a> specification. Contributions of any kind welcome!
zh_cn: 本项目遵循<a href="#">所有贡献者</a>规范。欢迎任何形式的贡献!

source: This property can be used to customize a `KeyStore` provider if `mp.jwt.verify.publickey.location` or `mp.jwt.decrypt.key.location` points to a `KeyStore` file.
zh_cn: 如果 `mp.jwt.verify.publickey.location` 或 `mp.jwt.decrypt.key.location` 指向一个 `KeyStore` 文件，该属性可用于定制一个 `KeyStore` 提供者。

source: This property can be used to customize a keystore type if either `mp.jwt.verify.publickey.location` or mp.jwt.decrypt.key.location` points to a `KeyStore` file. If it is not set then the file name will be checked to determine the keystore type before defaulting to `JKS`.
zh_cn: 如果 `mp.jwt.verify.publickey.location` 或 `mp.jwt.decrypt.key.location` 指向一个 `KeyStore` 文件，这个属性可以用来定制一个密钥库类型。如果没有设置，那么文件名将被检查以确定密钥库类型，默认为 `JKS` 。

source: This property can be used to set a default groups claim value when the current token has no standard or custom groups claim available.
zh_cn: 当当前令牌没有可用的标准或自定义的组声明时，此属性可用于设置默认组声明值。

source: This property can be used to set a default sub claim value when the current token has no standard or custom `sub` claim available. Effectively this property can be used to customize `java.security.Principal` name if no `upn` or `preferred_username` or `sub` claim is set.
zh_cn: 当当前令牌没有可用的标准或自定义 `sub` 声明时，此属性可用于设置默认的sub声明值。如果没有设置 `upn` 或 `preferred_username` 或 `sub` 声明，该属性可有效地用于自定义 `java.security.Principal` 名称。

source: This property has to be set to identify a private decryption key if `mp.jwt.decrypt.key.location` points to a `KeyStore` file.
zh_cn: 如果 `mp.jwt.decrypt.key.location` 指向 `KeyStore` 文件，则必须将此属性设置为标识专用解密密钥。

source: This property has to be set to identify a public verification key which will be extracted from `KeyStore` from a matching certificate if `mp.jwt.verify.publickey.location` points to a `KeyStore` file.
zh_cn: 这个属性必须被设置，以确定一个公共验证密钥，如果 `mp.jwt.verify.publickey.location` 指向 `KeyStore` 文件，该密钥将从所匹配的证书中的 `KeyStore` 中提取。

source: This property is required if the `service` application is expected to introspect the tokens remotely - which is always the case for the opaque tokens. This property is optional if the local Json Web Key token verification only is used.
zh_cn: 如果 `service` 应用程序被期望是远程自省令牌--对于不透明的令牌来说总是这样，那么这个属性是必需的。如果只使用本地Json Web Key令牌验证，那么该属性是可选的。

source: This property may be set if a private decryption key's password in `KeyStore` is different to `smallrye.jwt.keystore.password` when `mp.jwt.decrypt.key.location` points to a `KeyStore` file.
zh_cn: 如果 `mp.jwt.decrypt.key.location` 指向 `KeyStore` 文件时，并且 `KeyStore` 中的专用解密密钥的密码与 `smallrye.jwt.keystore.password` 不同，则可以设置此属性。

source: This reference guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Kafka.
zh_cn: 本参考指南展示了如何在您的Quarkus应用程序中利用SmallRye Reactive Messaging与Apache Kafka进行交互。

source: This reference guide explains how to develop command line applications with Quarkus.
zh_cn: 本参考指南解释了如何用Quarkus开发命令行应用程序。

source: This reference guide explains in more details the configuration and usage of the Quarkus Mailer.
zh_cn: 本参考指南更详细地解释了Quarkus Mailer的配置和使用。

source: This reference guide provides advanced details about the usage and the configuration of the Vert.x instance used by Quarkus.
zh_cn: 本参考指南提供了关于Quarkus使用的Vert.x实例的使用和配置的高级细节。

source: This reference guide provides an in-depth look on Apache Kafka and Smallrye Reactive Messaging framework.
zh_cn: 本参考指南深入介绍了Apache Kafka和Smallrye响应式消息传递框架。

source: This resource creates a `WebClient` and, upon request, uses this client to invoke a remote HTTP API. Depending on the result, the response is forwarded as received, or it creates a JSON object wrapping the error. The `WebClient` is asynchronous (and non-blocking), to the endpoint returns a `Uni`.
zh_cn: 该资源创建了一个 `WebClient` ，并在请求时使用该客户端来调用远程HTTP API。根据结果，响应被转发，或者创建一个包含错误的 JSON 对象。 `WebClient` 是异步的（和非阻塞的），端点返回一个 `Uni` 。

source: This response is sent back using the reply mechanism
zh_cn: 使用回复机制发回此响应

source: This same demo can be compiled into native code: no modifications required.
zh_cn: 这个同样的演示可以被编译成本地代码：不需要任何修改。

source: This secret key JWK will also need to be referred to with `smallrye.jwt.verify.key.location`. `smallrye.jwt.verify.algorithm` should be set to `HS256`/`HS384`/`HS512`.
zh_cn: 这个密匙JWK也需要用 `smallrye.jwt.verify.key.location` 。 `smallrye.jwt.verify.algorithm` 应该设置为 `HS256` / `HS384` / `HS512` 。

source: This section explains how to connect to notorious Kafka Cloud Services.
zh_cn: 本节解释了如何连接到臭名昭著的Kafka云服务。

source: This section gives an example using the Vert.x `WebClient` in the context of a RESTEasy Reactive application. As indicated in the table above, add the following dependency to your project:
zh_cn: 本节给出一个在RESTEasy Reactive应用程序中使用Vert.x `WebClient` 的例子。如上表所示，在你的项目中添加以下依赖：

source: This technology is considered {extension-status}.
zh_cn: 这项技术被认为是{extension-status}。

source: This tells RESTAssured to prefix all requests with `/hello`.
zh_cn: 这将使RESTAssured在所有请求之前加上 `/hello` 。

source: This test uses HTTP to directly test our REST endpoint. When the test is run the application will be started before the test is run.
zh_cn: 该测试使用HTTP来直接测试我们的REST节点。当运行测试时，应用程序将在测试运行前被启动。

source: This time, we return a Multi as we want to stream the chunks
zh_cn: 这一次，我们返回一个Multi类型的对象，因为我们想要流式地处理这些块

source: This time, you can see our list of legumes.
zh_cn: 这一次，你可以看到我们的legumes列表。

source: This website is licensed under the [Creative Commons Attribution 3.0](https://creativecommons.org/licenses/by/3.0/).
zh_cn: 本网站是根据 [知识共享署名许可协议 3.0](https://creativecommons.org/licenses/by/3.0/) 维护。

source: This will add the following to your `pom.xml`:
zh_cn: 这将在你的 `pom.xml` 中添加以下内容：

source: This will add the following to your build file:
zh_cn: 这会在你的构建文件中添加以下内容:

source: This will also listen for a debugger on port `5005`. If you want to wait for the debugger to attach before running you can pass `-Dsuspend` on the command line. If you don't want the debugger at all you can use `-Ddebug=false`.
zh_cn: 这也将在端口 `5005` 上监听调试器。如果你想在运行前等待调试器的连接，你可以在命令行中传递 `-Dsuspend` 。如果你根本不想要调试器，你可以使用 `-Ddebug=false` 。

source: This will compile and package your code.
zh_cn: 这将对你的代码进行编译和打包。

source: This will compile the code and run the unit tests included within the generated project. Unit testing is the same as any other Java project and does not require running on Amazon. Quarkus dev mode is also available with this extension.
zh_cn: 这将编译代码并运行生成的项目中包含的单元测试。单元测试和其他的Java项目一样，不需要运行在Amazon上。Quarkus开发模式也可以通过这个扩展来提供。

source: This will only work on platforms that support <<native-transport>>.
zh_cn: 这仅适用于支持 link:#native-transport[[native-transport]] 的平台。

source: This will only work when the entity extends `PanacheMongoEntityBase` and not `PanacheMongoEntity`, as the ID field also needs to be included in the constructor.
zh_cn: 这只有在实体继承了 `PanacheMongoEntityBase` ，而不是 `PanacheMongoEntity` ，这样才会起作用，因为ID字段也需要被包含在构造函数中。

source: This will start a Docker container that mimics Amazon's Lambda's deployment environment. Once the environment is started you can invoke the example lambda in your browser by going to:
zh_cn: 这将启动一个模仿亚马逊的Lambda部署环境的Docker容器。一旦环境启动了，你就可以在你的浏览器中调用lambda示例，方法是去：

source: This works equally well when the JSON content is a request body or is wrapped in a `Uni`, `Multi`, `CompletionStage` or `Publisher`.
zh_cn: 当JSON内容是一个请求体或被包裹在一个 `Uni` , `Multi` , `CompletionStage` 或 `Publisher` 中时，这同样适用。

source: Thus, the `all-open` Kotlin compiler plugin allows us to configure the compiler to *not* mark as `final` classes that have certain annotations. In the snippet above, we have specified that classes annotated with `javax.ws.rs.Path` should not be `final`.
zh_cn: 因此， `all-open` Kotlin编译器插件允许我们对编译器进行配置，使其 *不* 将有某些注解的类标记为 `final` 。在上面的片段中，我们已经指定了带有 `javax.ws.rs.Path` 注解的类不应该是 `final` 的 。

source: Timers and distribution summaries in Micrometer are very similar. Both allow you to record an observed value, which will be aggregated with other recorded values and stored as a sum. Micrometer also increments a counter to indicate the number of measurements that have been recorded and tracks the maximum observed value (within a decaying interval).
zh_cn: Micrometer中的Timers和distribution summaries非常相似。两者都允许您记录这样一种观察值，它将与其他记录值汇总并作为一个总和来被记录。Micrometer也会使用一个counter来表示已经记录的测量值的个数，并且跟踪最大的观察值（在一个衰减的区间内）。

source: Tips for writing native applications
zh_cn: 编写原生应用程序的提示

source: To access the managed Vert.x instance, add the `quarkus-vertx` extension to your project. Note that this dependency may already be installed (as a transitive dependency).
zh_cn: 要访问管理的Vert.x实例，请在你的项目中添加 `quarkus-vertx` 扩展。注意，这个依赖可能已经安装了（作为一个过渡性依赖）。

source: To achieve this you need to specify a compatible container type to receive all the data:
zh_cn: 为了达到这一点，您需要指定一个兼容的容器类型来接收所有数据：

source: To add the OWASP Dependency check plugin to your Quarkus Maven project, add the following XML configuration to the `pom.xml` file:
zh_cn: 要在Quarkus Maven项目中添加OWASP依赖性检查插件，请在 `pom.xml` 文件中添加以下XML配置：

source: To alleviate this restriction, the `@QuarkusTest` annotation defines a JUnit 5 `@Tag`: `io.quarkus.test.junit.QuarkusTest`. You can use this tag to isolate the `@QuarkusTest` test in a specific execution run, for example with the Maven Surefire Plugin:
zh_cn: 为缓解这一限制， `@QuarkusTest` 注解定义了一个 JUnit 5 的 `@Tag` : `io.quarkus.test.junit.QuarkusTest` 。您可以使用该标记在特定的执行中隔离 `@QuarkusTest` 测试，例如使用Maven Surefire插件：

source: To allow your Quarkus application to use that secret, add the following line to the `application.properties` file:
zh_cn: 为了允许您的Quarkus应用程序使用该secret，请在 `application.properties` 文件中添加下面一行：

source: To be able to set the address per message, the connector is using an _anonymous sender_.
zh_cn: 为了能够按消息设置地址，连接器使用了一个 _anonymous sender_ 。

source: To better understand the contrast, we need to explain the difference between the reactive and imperative execution models. It's essential to comprehend that _Reactive_ is not just a different execution model, but that distinction is necessary to understand this guide.
zh_cn: 为了更好地理解这种对比，我们需要解释响应式执行模型和指令式执行模型之间的区别。理解 _Reactive_ 不仅仅是一种不同的执行模型是必要的，而且这一区别对于理解本指南是必要的。

source: To better understand, let's detail how the HTTP request/response has been handled:
zh_cn: 为了更好地理解，让我们详细介绍一下HTTP request/response 是如何被处理的：

source: To complete this guide, you need:
zh_cn: 要完成这个指南，你需要：

source: To configure the inbound connector to use the provided listener, we either set the consumer rebalance listener’s identifier: `mp.messaging.incoming.rebalanced-example.consumer-rebalance-listener.name=rebalanced-example.rebalancer`
zh_cn: 如要配置inbound connector使用所提供的监听器，我们可以通过消费者再平衡监听器的标识符 `mp.messaging.incoming.rebalanced-example.consumer-rebalance-listener.name=rebalanced-example.rebalancer` 来设置

source: To configure the protected routes using the `@RolesAllowed` annotation or the `application.properties` file, check the xref:security-openid-connect.adoc[Using OpenID Connect Adapter to Protect JAX-RS Applications] and xref:security-authorization.adoc[Security Authorization] guides. For more details, check the xref:security.adoc[Security guide].
zh_cn: 要使用 `@RolesAllowed` 注解或 `application.properties` 文件配置受保护的路由，请查看《 link:security-openid-connect.html[使用 OpenID 连接适配器保护 JAX-RS 应用程序] 》和《 link:security-authorization.html[安全授权] 》指南。更多细节，请查看 link:security.html[安全指南]

source: To connect to Azure Event Hub, using the Kafka protocol with TLS, you need the following configuration:
zh_cn: 使用带有TLS的Kafka协议连接到Azure Event Hub的话，您需要以下配置：

source: To consume `Fruit` instances stored on a Kafka topic, and persist them into a database, you can use the following approach:
zh_cn: 为了消费存储在Kafka topic上的 `Fruit` 实例，并将其持久化到数据库中，您可以使用以下方法：

source: To control the RESTassured base path (i.e. the default path that serves as the root for every request) you can use the `io.quarkus.test.common.http.TestHTTPEndpoint` annotation. This can be applied at the class or method level. To test out greeting resource we would do:
zh_cn: 为了控制RESTassured基础路径（即作为每个请求根路径的默认路径），您可以使用 `io.quarkus.test.common.http.TestHTTPEndpoint` 注解。可以在类或方法层面上使用。为了测试greeting资源类，我们可以这样做：

source: To create a Gradle project, add the `--gradle` or `--gradle-kotlin-dsl` option.
zh_cn: 创建Grade项目，请添加 `--gradle` 或者 `--gradle-kotlin-dsl` 参数。

source: To create a Gradle project, add the `-DbuildTool=gradle` or `-DbuildTool=gradle-kotlin-dsl` option.
zh_cn: 创建Grade项目，请添加 `-DbuildTool=gradle` 或者 `-DbuildTool=gradle-kotlin-dsl` 参数。

source: To create the _processor_ project, from the same directory, run:
zh_cn: 要创建 _processor_ 项目，请在同一目录下运行：

source: To create the _producer_ project, in a terminal run:
zh_cn: 要创建 _producer_ 项目，请在终端中运行：

source: To define a Panache entity, simply extend `PanacheEntity`, annotate it with `@Entity` and add your columns as public fields:
zh_cn: 要定义一个Panache实体类，只需继承 `PanacheEntity` ，增加 `@Entity` 注解，并将数据库列作为公共字段添加到实体类：

source: To define a Panache entity, simply extend `PanacheMongoEntity` and add your columns as public fields. You can add the `@MongoEntity` annotation to your entity if you need to customize the name of the collection, the database, or the client.
zh_cn: 要定义一个Panache实体，只需扩展 `PanacheMongoEntity` ，并添加你的列作为公共字段。如果你需要自定义集合、数据库或客户端的名称，你可以向你的实体添加 `@MongoEntity` 注解。

source: To deploy a native executable, you must build it with GraalVM.
zh_cn: 要部署一个本地可执行文件，你必须用GraalVM构建它。

source: To deploy multiple instances of your verticle, use the `@Dependent` scope instead of `@ApplicationScoped`:
zh_cn: 要部署 Verticle 的多个实例，请使用 `@Dependent` 范围而不是 `@ApplicationScoped` ：

source: To deploy to AWS Lambda:
zh_cn: 要部署到AWS Lambda：

source: To deploy verticles, use the `deployVerticle` method:
zh_cn: 要部署verticles，使用 `deployVerticle` 方法。

source: To disable health reporting, set the `health-enabled` attribute for the channel to false. On the inbound side (receiving messages from AMQP), the check verifies that the receiver is attached to the broker. On the outbound side (sending records to AMQP), the check verifies that the sender is attached to the broker.
zh_cn: 要禁用健康报告，请将通道的 `health-enabled` 属性设为false。在入站端（接收来自AMQP的消息），检查会验证接收者是否连接到代理。在出站端（向AMQP发送记录），检查会验证发送者是否连接到代理。

source: To do this, first create a directory `src/main/zip.native/` with your build. Next create a shell script file called `bootstrap` within `src/main/zip.native/`, like below. An example is create automatically in your build folder (target or build), called `bootstrap-example.sh`
zh_cn: 要做到这一点，首先使用你的构建创建一个目录 `src/main/zip.native/` 。接下来在 `src/main/zip.native/` 中创建一个名为 `bootstrap` 的shell脚本文件，如下所示。例如，在你的构建文件夹（target或 build）中自动创建一个名为 `bootstrap-example.sh` 的文件

source: To do this, we will need to setup JSON serialization with Jackson or JSON-B.
zh_cn: 要做到这一点，我们需要用Jackson或JSON-B来设置JSON序列化。

source: To ease the containerization of native executables, Quarkus provides a base image providing the requirements to run these executables. The `quarkus-micro-image:1.0` image is:
zh_cn: 为了简化本地可执行文件的容器化步骤，Quarkus提供了一个包含运行这些可执行文件依赖的基础镜像。 `quarkus-micro-image:1.0` 镜像是:

source: To enable YAML configuration, add the `quarkus-config-yaml` extension:
zh_cn: 要启用YAML配置，添加以下 `quarkus-config-yaml` 扩展:

source: To enable the alternative DNS resolver, use:
zh_cn: 要启用备用 DNS 解析器，请使用：

source: To enable this security feature, add this to your `application.properties` file:
zh_cn: 要启用这一安全特性，请将此添加到你的 `application.properties` 文件中：

source: To ensure full-compability with `native-image`, it is recommended to apply the Jackson `@field:JsonProperty("fieldName")` annotation, and set a nullable default, as illustrated below. You can automate the generation of Kotlin data classes for your sample JSON using Intellij plugins (such as JSON to Kotlin Class), and easily enable the Jackson annotation and select nullable parameters as part of the auto-code generation.
zh_cn: 为了确保与 `native-image` 的完全兼容性，建议使用Jackson `@field:JsonProperty("fieldName")` 注解，并设置一个空默认值，如下图所示。您可以使用Intellij插件（如JSON to Kotlin Class）为您的样例JSON自动生成Kotlin数据类，并轻松启用Jackson注解和选择并选择可为空的参数，作为自动代码生成的一部分。

source: To extract the required ssl, you must start up a Docker container in the background, and attach to that container to copy the artifacts.
zh_cn: 要提取所需的ssl，你必须在后台启动一个Docker容器，并附加到该容器来复制工件。

source: To generate debug symbols, add `-Dquarkus.native.debug.enabled=true` flag when generating the native executable. You will find the debug symbols for the native executable in a `.debug` file next to the native executable.
zh_cn: 要生成调试符号，在生成原生可执行文件时添加 `-Dquarkus.native.debug.enabled=true` 标志。你将在原生可执行文件旁边的 `.debug` 文件中找到原生可执行文件的调试符号。

source: To get around this Quarkus supports the idea of a test profile. If a test has a different profile to the previously run test then Quarkus will be shut down and started with the new profile before running the tests. This is obviously a bit slower, as it adds a shutdown/startup cycle to the test time, but gives a great deal of flexibility.
zh_cn: 为了解决这个问题，Quarkus支持测试profile。如果一个测试有一个与之前运行的测试不同的profile，那么Quarkus将被停止，并在运行对应的测试之前使用新的profile启动。这显然会有些许变慢，因为它在测试时间上增加了一个停止/启动周期，但同时也提供了很大的灵活性。

source: To get started using MongoDB with Panache with Kotlin, you can, generally, follow the steps laid out in the Java tutorial. The biggest change to configuring your project is the Quarkus artifact to include. You can, of course, keep the Java version if you need but if all you need are the Kotlin APIs then include the following dependency instead:
zh_cn: 要开始使用带有 Kotlin 的 Panache 的 MongoDB，您通常可以按照 Java 教程中列出的步骤进行操作。配置项目的最大变化是要包含的 Quarkus 工件。当然，如果需要，您可以保留 Java 版本，但如果您只需要 Kotlin API，那么请包含以下依赖项：

source: To get started:
zh_cn: 起步：

source: To implement a test profile we need to implement `io.quarkus.test.junit.QuarkusTestProfile`:
zh_cn: 为了实现一个测试profile，我们需要实现 `io.quarkus.test.junit.QuarkusTestProfile` ：

source: To implement this process, you need the following approach:
zh_cn: 为了实现这一过程，您需要采取以下方法：

source: To improve user experience, Quarkus registers the three Jackson https://github.com/FasterXML/jackson-modules-java8[Java 8 modules] so you don't need to do it manually.
zh_cn: 为了提高用户体验，Quarkus注册了三个Jackson link:https://github.com/FasterXML/jackson-modules-java8[Java 8模块] ，所以你不需要手动操作。

source: To include more resources in the native executable, the easiest way is to use the `quarkus.native.resources.includes` configuration property, and its counterpart to exclude resources `quarkus.native.resources.excludes`.
zh_cn: 要在原生可执行文件中包含更多的资源，最简单的方法是使用 `quarkus.native.resources.includes` 配置属性，及其对应的排除资源 `quarkus.native.resources.excludes`。

source: To increment a value, run the following command:
zh_cn: 要增加键的值，请运行以下命令：
